const { Fragment } = require("react");

const yesterdaySick = <Fragment>
    <p>מספר המאומתים לנגיף COVID-19 שאותרו משעה 00:00 עד שעה 23:59 של יום אתמול.</p>
    <p>סה"כ: מספר המאומתים מפרוץ המגיפה, כולל מי שהתגלו כמאומתים לנגיף שוב.</p>
    <p>מאומתים - מי שנבדקו ונמצאו חיוביים לנגיף COVID-19 בבדיקת PCR או בבדיקת אנטיגן מפוקחת (החל מה 5.1.2022) , בין אם הופיעו אצלם תסמינים ובין אם לא, בין אם הם חולים, החלימו או נפטרו.</p>
    <p>מספר החולים הפעילים במחלת הנגיף COVID-19, נכון למועד העדכון האחרון.</p>
    <p>חולים פעילים - מי שנבדקו ונמצאו חיוביים לנגיף COVID-19 בבדיקת PCR או בבדיקת אנטיגן מפוקחת (החל מה 5.1.2022), ללא קשר להופעת תסמינים, שעוד לא הוגדרו כמחלימים ושלא נפטרו.</p>
</Fragment>;

const sick = <Fragment>
    <p>מספר החולים במצב קשה וקריטי המאושפזים בבתי החולים.</p>
    <p>חולה קשה - מי שחולה במחלת נגיף COVID-19 ושהוגדר במצב קשה או קריטי על ידי מערכת הבריאות.</p>
</Fragment>;

const vaccinated = <Fragment>
    <p>מספר מקבלי החיסון מפני נגיף COVID-19 מתחילת מבצע החיסונים לפי מספרי המנות.</p>
</Fragment>;

const dead = <Fragment>
    <p>מספר הנפטרים המצטבר ממחלת הנגיף COVID-19 החל מפרוץ המגפה.
נתוני הנפטרים מתעדכנים לאחר שנבדקו תעודות הפטירה לוידוא סיבת המוות ולכן ייתכנו עדכונים מאוחרים של מספר הנפטרים.
</p>
</Fragment>;

const yesterdaySickPercent = <Fragment>
    <p>אחוז הנבדקים שנמצאו חיוביים לנגיף COVID-19 מתוך מספר נבדקים לגילוי הנגיף אתמול.</p>
    <p>נבדקים לגילוי הנגיף אתמול - מספר הנבדקים לאיתור ראשוני של הנגיף (ללא בדיקות נלוות לקביעת החלמה) בבדיקות PCR או אנטיגן מפוקחות, שהתבצעו ותוצאותיהן התקבלו משעה 00:00 עד שעה 23:59 של יום אתמול.</p>
    <p>כלל הבדיקות אתמול – מספר כל תוצאות הבדיקות לגילוי קורונה שבוצעו מסוג PCR או אנטיגן ,הן לבדיקה ראשונית לאיתור הנגיף והן לבדיקות נלוות לקביעת החלמה, שהתקבלו החל מחצות 00:00 עד שעה 23:59 של יום אתמול.</p>
</Fragment>;

const yesterdayIsolated = <Fragment>
    <p>מספר הבידודים המדווחים משעה 00:00 עד שעה 23:59 של יום אתמול, מלבד החולים הפעילים.</p>
    <p>סה"כ שוהים בבידוד - סך האנשים השוהים בבידוד נכון למועד העדכון האחרון, מלבד החולים הפעילים.</p>
</Fragment>;

const weeklySick= <Fragment>
    <p>מספר המאומתים לנגיף COVID-19 שאותרו ב-7 הימים האחרונים (לא כולל את יום העדכון) והשינוי באחוזים לעומת 7 הימים הקודמים.</p>
</Fragment>;

const weeklySeriouslySick = <Fragment>
    <p>מספר החולים החדשים במצב קשה וקריטי במחלת נגיף COVID-19 ב-7 הימים האחרונים (לא כולל את יום העדכון) והשינוי באחוזים לעומת 7 הימים הקודמים.</p>
</Fragment>;

const weeklyDead = <Fragment>
    <p>מספר הנפטרים מנגיף COVID-19 ב-7 הימים האחרונים (לא כולל את יום העדכון) והשינוי באחוזים לעומת 7 הימים הקודמים.</p>
</Fragment>;

const weeklyTested = <Fragment>
    <p>מספר הנבדקים בבדיקות לגילוי נגיף COVID-19 מסוג PCR או אנטיגן ב-7 הימים האחרונים (לא כולל את יום העדכון) והשינוי באחוזים לעומת 7 הימים הקודמים.
הנתון אינו כולל נבדקים בבדיקות נלוות לקביעת החלמה.</p>
    <p>נבדקים חיוביים - אחוז הנבדקים שנמצאו חיוביים לנגיף COVID-19 מתוך מספר הנבדקים לגילוי הנגיף ב 7 הימים האחרונים.</p>
</Fragment>;

const citiesVaccination = <Fragment>
    <p>ישובים בהם יותר מ-2,000 תושבים. לכל ישוב מוצגים
,אחוז מקבלי חיסון מנה ראשונה, מנה שניה ומנה שלישית
,מספר חולים פעילים לכל 10,000 תושבים
.הציון היומי המחושב לישוב מתוכנית הרמזור</p>
</Fragment>;

const dailyVerifiedSick = <Fragment>
    <p>מספר החולים היומי במחלת נגיף COVID-19 המאושפזים בבתי חולים בחלוקה לפי מצב רפואי : קשה (כולל קריטי), בינוני וקל.</p>
</Fragment>

const dailyVerified = <Fragment>
    <p>המספר היומי של נדבקים בנגיף COVID-19 והממוצע נע ב 7 ימים.</p>
    <p>מאומתים - מי שנבדקו ונמצאו חיוביים לנגיף COVID-19 בבדיקת PCR או בבדיקת אנטיגן מפוקחת (החל מה 5.1.2022) , בין אם הופיעו אצלם תסמינים ובין אם לא, בין אם הם חולים, החלימו או נפטרו.</p>
</Fragment>

const weeklyVerified = <Fragment>
    <p>ממוצע יומי של מאומתים חדשים לכל שבוע.</p>
    <p>מאומתים - מי שנבדקו ונמצאו חיוביים לנגיף COVID-19 בבדיקת PCR או בבדיקת אנטיגן מפוקחת (החל מה 5.1.2022) , בין אם הופיעו אצלם תסמינים ובין אם לא, בין אם הם חולים, החלימו או נפטרו.</p>
</Fragment>

const Seg = <Fragment>
    <p>פילוח המאומתים לנגיף COVID-19 לפי קבוצות גיל באוכלוסייה ולפי פילוח זכר ונקבה
ניתן לסנן את נתוני המאומתים לפי קבוצות: חולים קשה, מונשמים ונפטרים</p>
</Fragment>

const dailyDead = <Fragment>
    <p>מגמת השינוי היומית במספר הנפטרים ממחלת הנגיף COVID-19, לאורך ציר הזמן.
נתוני הנפטרים מתעדכנים לאחר שנבדקו תעודות הפטירה לוידוא סיבת המוות ולכן ייתכנו עדכונים מאוחרים של מספר הנפטרים.</p>
</Fragment>

const statusR = <Fragment>
    <p>מקדם הדבקה R - המספר הממוצע של אנשים שידבקו מאדם שנושא את הנגיף COVID-19.</p>
    <p>כשהערך של R גבוה מ-1 - המחלה מתפשטת, כלומר מספר הנדבקים גדל.</p>
    <p>10 הימים בהם לא מוצג ערך ל-R מבטאים זמן השהייה ממוצע מרגע ההדבקה עד אימות הנדבקים ותהליך חישוב ממוצע שבועי לקבלת ערך אמין.
מקדם ההדבקה R מעיד על קצב השינוי במספר המאומתים הכללי בארץ, וכולל גם את המאומתים השבים מחו"ל (ולכן הוא רק קירוב של מקדם ההדבקה).</p>
    <p>ניתן להציג את הנתונים לפי תקופות או סביב אירוע חשוב, באמצעות כפתור הסינון בצד ימין למעלה.
הסבר מפורט על שיטת החישוב ניתן לקרא במסמך "חישוב מקדם ההדבקה R" של מרכז המידע והידע הלאומי למערכה בקורונה.</p>
</Fragment>

const bedPercent = <Fragment>
    <p>אריח זה מציג בכל יום את אחוז התפוסה היומית במחלקות פנימיות בכלל בתי החולים ואת האחוז הממוצע של הנתון ב-7 הימים האחרונים בשנה קודמת עבור אותו יום .
ניתן לבחור בכלל המחלקות ובבית חולים מסוים.
ניתן לבחור תצוגה עד למשך שנה .</p>
</Fragment>

const childVerified = <Fragment>
    <p>המספר היומי הממוצע ב-7 הימים האחרונים של מאומתים עד גיל 19 בחלוקה לפי 4 קבוצות גיל: 4-0, 11-5, 12-15, 19-16.</p>
    <p>מאומתים - מי שנבדקו ונמצאו חיוביים לנגיף COVID-19 בבדיקת PCR או בבדיקת אנטיגן מפוקחת (החל מה 5.1.2022) , בין אם הופיעו אצלם תסמינים ובין אם לא, בין אם הם חולים, החלימו או נפטרו.</p>
</Fragment>

const childIsolated = <Fragment>
    <p>המספר היומי הממוצע ב-7 הימים האחרונים של דיווחים על בידודים בקרב האוכלוסייה עד גיל 19 בחלוקה לפי 4 קבוצות גיל: 4-0, 11-5, 15-12, 19-16.</p>
</Fragment>

const childHospitalized = <Fragment>
    <p>אריח זה מציג את הממוצע היומי של ילדים באשפוז עקב נגיף הקורונה ב-7 הימים האחרונים בקרב האוכלוסייה עד גיל 19, בחלוקה לפי קבוצות גיל: 0 עד 4, 5 עד 11, 12 עד 15, 16 עד 19</p>
</Fragment>

const childPercentCity = <Fragment>
    <p>אחוז התחלואה עד גיל 19 ביחס לתחלואה הכללית בישובים בהם מעל 2000 תושבים ומספר החולים הפעילים עד גיל 19 מעל 14.
ציר הגובה מייצג את אחוז החולים הפעילים עד גיל 19 וציר הרוחב מייצג את מספר החולים הפעילים לכל 10,000 תושבים בישוב.
הנקודות מייצגות את הישובים ומיקומם על פני 2 הצירים.
כל ישוב צבוע בצבע הסיווג אליו הוא שייך לפי מודל הרמזור.</p>
</Fragment>

const seniorDailyVerified = <Fragment>
    <p>המספר היומי של נדבקים בנגיף COVID-19, לפי מצב התחסנות.</p>
    <p>מחוסנים:
- מי שקיבלו 2 מנות חיסון או יותר ועבר שבוע מאז קבלת המנה האחרונה (שבועיים בחיסוני מודרנה) אך עוד לא עבר מאז תוקף הזמן שנקבע למנה
- מי שהחלימו וקיבלו לאחר מכן לפחות מנת חיסון אחת ועבר שבוע מאז קבלת המנה (שבועיים בחיסוני מודרנה)
- מי שקיבלו לפחות מנת חיסון אחת ולאחר מכן נדבקו והחלימו</p>
    <p>מחוסנים ללא תוקף - מי שקיבלו 2 מנות חיסון ועברו יותר מחצי שנה ושבוע מאז קבלת המנה האחרונה (חצי שנה ושבועיים בחיסוני מודרנה) ולא קיבלו מנה נוספת.</p>
</Fragment>

const seniorSeriouslySick = <Fragment>
    <p>המספר היומי של חולים במחלת נגיף COVID-19 במצב קשה (כולל במצב קריטי), לאורך זמן, המאושפזים בבתי חולים לאשפוז כללי, לפי מצב התחסנות.</p>
    <p>חולים קשה – פעילים: מספר החולים במצב קשה וקריטי בסוף כל יום.</p>
    <p>מחוסנים:
- מי שקיבלו 2 מנות חיסון או יותר ועבר שבוע מאז קבלת המנה האחרונה (שבועיים בחיסוני מודרנה) אך עוד לא עבר מאז תוקף הזמן שנקבע למנה
- מי שהחלימו וקיבלו לאחר מכן לפחות מנת חיסון אחת ועבר שבוע מאז קבלת המנה (שבועיים בחיסוני מודרנה)
- מי שקיבלו לפחות מנת חיסון אחת ולאחר מכן נדבקו והחלימו
</p>
<p>מחוסנים ללא תוקף - מי שקיבלו 2 מנות חיסון ועברו יותר מחצי שנה ושבוע מאז קבלת המנה האחרונה (חצי שנה ושבועיים בחיסוני מודרנה) ולא קיבלו מנה נוספת.</p>
</Fragment>

const SickByAge = <Fragment>
    <p>פילוח של מספר החולים הפעילים וחולים קשה במחלת נגיף COVID-19, לפי קבוצות גיל באוכלוסייה ולפי מצבי התחסנות בכל קבוצת גיל.</p>
    <p>לאור גידול באוכלוסייה בקבוצות הגיל בישראל, חל עדכון בתמונת נתונים המוצגת. נתוני אוכלוסיה כעת מתייחסים לאפריל 2021.</p>
    <p>חולים פעילים - הם כל מי שנבדקו ונמצאו חיוביים לנגיף COVID-19, ללא קשר להופעת תסמינים, שלא קיבלו עדיין תוצאה שלילית לנגיף בבדיקות נוספות ושלא נפטרו.</p>
    <p>מחוסנים:
- מי שקיבלו 2 מנות חיסון או יותר ועבר שבוע מאז קבלת המנה האחרונה (שבועיים בחיסוני מודרנה) אך עוד לא עבר מאז תוקף הזמן שנקבע למנה
- מי שהחלימו וקיבלו לאחר מכן לפחות מנת חיסון אחת ועבר שבוע מאז קבלת המנה (שבועיים בחיסוני מודרנה)
- מי שקיבלו לפחות מנת חיסון אחת ולאחר מכן נדבקו והחלימו</p>
<p>מחוסנים ללא תוקף - מי שקיבלו 2 מנות חיסון ועברו יותר מחצי שנה ושבוע מאז קבלת המנה האחרונה (חצי שנה ושבועיים בחיסוני מודרנה) ולא קיבלו מנה נוספת.</p>
</Fragment>

const dailySick = <Fragment>
    <p>מספר החולים היומי במחלת נגיף COVID-19 המאושפזים בבתי חולים בחלוקה לפי מצב רפואי : קשה (כולל קריטי), בינוני וקל.</p>
</Fragment>

const dailyHospitalized = <Fragment>
    <p>השינוי היומי במספר החולים במחלת נגיף COVID-19 המאושפזים בבתי חולים בכל אחד מ 3 המצבים הרפואיים: קל, בינוני וקשה (כולל קריטי)
הנתון היומי מציג את מספר החולים לפי מצבם הרפואי החדש אם יום קודם הוגדרו במצב רפואי אחר</p>
</Fragment>

const dailyDeadVaccinated = <Fragment>
    <p>המספר היומי של הנפטרים מנגיף COVID-19, לאורך הזמן, לפי מצב התחסנות.</p>
    <p>מחוסנים:
- מי שקיבלו 2 מנות חיסון או יותר ועבר שבוע מאז קבלת המנה האחרונה (שבועיים בחיסוני מודרנה) אך עוד לא עבר מאז תוקף הזמן שנקבע למנה
- מי שהחלימו וקיבלו לאחר מכן לפחות מנת חיסון אחת ועבר שבוע מאז קבלת המנה (שבועיים בחיסוני מודרנה)
- מי שקיבלו לפחות מנת חיסון אחת ולאחר מכן נדבקו והחלימו</p>
<p>מחוסנים ללא תוקף - מי שקיבלו 2 מנות חיסון ועברו יותר מחצי שנה ושבוע מאז קבלת המנה האחרונה (חצי שנה ושבועיים בחיסוני מודרנה) ולא קיבלו מנה נוספת.</p>
</Fragment>

const coronaTests = <Fragment>
    <p>המספר היומי של בדיקות PCR ובדיקות אנטיגן מפוקחות לגילוי נגיף COVID-19 שבוצעו.
החישוב כולל רק בדיקות ראשונות לגילוי הנגיף (ללא בדיקות נלוות לבדיקת החלמה).</p>
</Fragment>

const isolationReasons = <Fragment>
    <p>מספר הדיווחים היומי על בידודים לפי סיבות הבידוד : חזרה מחו"ל, חשיפה עם מאומת ואחר
אריח זה אינו כולל מאומתים בבידוד</p>
</Fragment>

const coronaStrength = <Fragment>
    <p>מקדם הדבקה R - המספר הממוצע של אנשים שידבקו מאדם שנושא את הנגיף COVID-19.
כשהערך של R גבוה מ-1 - המחלה מתפשטת, כלומר מספר הנדבקים גדל.
מקדם ההדבקה R מחושב בכל יום.</p>
<p>10 הימים בהם לא מוצג ערך ל-R מבטאים זמן השהייה ממוצע מרגע ההדבקה עד אימות הנדבקים ותהליך חישוב ממוצע שבועי לקבלת ערך אמין.
מקדם ההדבקה R מעיד על קצב השינוי במספר המאומתים הכללי בארץ, וכולל גם את המאומתים השבים מחו"ל (ולכן הוא רק קירוב של מקדם ההדבקה).</p>
<p>ניתן להציג את הנתונים לפי תקופות או סביב אירוע חשוב, באמצעות כפתור הסינון בצד ימין למעלה.
הסבר מפורט על שיטת החישוב ניתן לקרא במסמך "חישוב מקדם ההדבקה R" של מרכז המידע והידע הלאומי למערכה בקורונה.</p>
</Fragment>

const sickVaccinatedStats = <Fragment>
    <p>מגמת שינוי בכמות המאומתים עבור נקודות זמן חשובות לאורך תקופת מגיפת הקורונה, לאורך ציר זמן החל משבועיים לפני האירוע ועד חודש אחרי.</p>
    <p>אחוז מחוסנים מצטבר - אחוז המחוסנים בטווח התוקף החיסוני</p>
</Fragment>

const sickMaleFemale = <Fragment>
    <p>פילוח המאומתים לנגיף COVID-19 לפי קבוצות גיל באוכלוסייה ולפי פילוח זכר ונקבה
ניתן לסנן את נתוני המאומתים לפי קבוצות: חולים קשה, מונשמים ונפטרים</p>
</Fragment>

const info = [
    { key:'מאומתים אתמול' , value:yesterdaySick },
    { key:'חולים קשה' , value: sick },
    { key: 'מתחסנים', value: vaccinated},
    { key: 'נפטרים מצטבר' , value: dead},
    { key: 'אחוז נדבקים חיוביים אתמול', value: yesterdaySickPercent},
    { key: 'מבודדים חדשים אתמול' , value: yesterdayIsolated },
    { key: 'מספר המאומתים' , value: weeklySick},
    { key: 'מספר חולים קשה' , value: weeklySeriouslySick },
    { key: 'מספר נפטרים' , value: weeklyDead },
    { key: 'מספר נבדקים', value: weeklyTested },
    { key: 'התחסנות לפי ישובים' , value: citiesVaccination },
    { key: 'מספר מאושפזים-יומי', value: dailyVerifiedSick },
    { key: 'מאומתים חדשים יומי', value: dailyVerified },
    { key: 'ממוצע מאומתים שבועי', value: weeklyVerified},
    { key: 'פילוח מדדים שונים על פי גיל ומין', value: Seg},
    { key: 'נפטרים-יומי', value: dailyDead},
    { key: 'מקדם הדבקה', value: statusR},
    { key: 'אחוז תפוסת מיטות באשפוזים', value: bedPercent},
    { key: 'מגמת ילדים מאומתים - ממוצע נע 7 ימים', value: childVerified },
    { key: 'מגמת ילדים מבודדים - ממוצע נע 7 ימים', value: childIsolated },
    { key: 'מגמת ילדים באשפוז - ממוצע שבועי' , value: childHospitalized },
    { key: 'תחלואת ילדים ביחס לתחלואה הכללית -יישובים', value : childPercentCity },
    { key: 'מאומתים יומי - התחסנות', value: seniorDailyVerified },
    { key: 'חולים קשה - התחסנות' , value: seniorSeriouslySick },
    { key: 'חולים פעילים - גיל והתחסנות', value: SickByAge },
    { key: 'מספר חולים - יומי' , value: dailySick },
    { key: 'מצב מאושפזים - שינוי יומי', value: dailyHospitalized },
    { key: 'נפטרים יומי – מצב התחסנות' , value: dailyDeadVaccinated },
    { key: 'מספר בדיקות קורונה - יומי', value: coronaTests},
    { key: 'מגמת מבודדים חדשים – סיבת בידוד', value: isolationReasons},
    { key: 'מקדם ההדבקה R', value: coronaStrength },
    { key: 'תחקור תחלואה לאור אירועים והתחסנות', value: sickVaccinatedStats },
    { key: 'תחלואת נשים וגברים', value: sickMaleFemale }
]

const Information = ( title ) => {
    for(let i = 0; i < info.length; i++ )
        if( info[i].key === title )
            return info[i].value;
    return null;
}

export default Information;